const  products = [
    {
        id:1,
        pic:'https://raheshgroup.com/wp-content/uploads/2021/06/oman4.jpg',
        title:'دیپلماسی اقتصادی و توسعه روابط با عمان',
        bage:'پژوهش',
        time:'02 ژوئن 2021',
        text: `چکیده امروزه، تجارت بین الملل به عنوان یکی از مهم ترین 
            عوامل توسعه و رشد اقتصادی کشورها از طریق افزایش فرصت های تجاری و سرمایه گذاری محسوب می شود.
            پیوستن به زنجیره ارزش جهانی و توسعه صادرات در کشورهای
            در حال توسعه زمینه بهبود رقابت پذیری را در این کشورها فراهم می کند و
            افزایش ارزش افزوده محصولات، سرمایه گذاری در تحقیق وتوسعه، سرمایه گذاری...`

    },
     {
         id:2,
        pic:'https://raheshgroup.com/wp-content/uploads/2021/06/cyber.jpeg',
        title:'فضای سایبری آسیب هاو مخاطرات',
         bage:'پژوهش',
        time:'02 ژوئن 2021',
        text: `چکیده امروزه، تجارت بین الملل به عنوان یکی از مهم ترین 
            عوامل توسعه و رشد اقتصادی کشورها از طریق افزایش فرصت های تجاری و سرمایه گذاری محسوب می شود.
            پیوستن به زنجیره ارزش جهانی و توسعه صادرات در کشورهای
            در حال توسعه زمینه بهبود رقابت پذیری را در این کشورها فراهم می کند و
            افزایش ارزش افزوده محصولات، سرمایه گذاری در تحقیق وتوسعه، سرمایه گذاری...`


    },
     {
         id:3,
        pic:'https://raheshgroup.com/wp-content/uploads/2021/06/hormoz1.jpg',
        title:'بررسی موقعیت استراتژیک تنگه هرمز و نقش آن در امنیت ملی جمهوری اسلامی ایران ',
        bage:'پژوهش',
        time:'02 ژوئن 2021',
        text: `چکیده امروزه، تجارت بین الملل به عنوان یکی از مهم ترین 
            عوامل توسعه و رشد اقتصادی کشورها از طریق افزایش فرصت های تجاری و سرمایه گذاری محسوب می شود.
            پیوستن به زنجیره ارزش جهانی و توسعه صادرات در کشورهای
            در حال توسعه زمینه بهبود رقابت پذیری را در این کشورها فراهم می کند و
            افزایش ارزش افزوده محصولات، سرمایه گذاری در تحقیق وتوسعه، سرمایه گذاری...`


    },
     {
         id:4,
        pic:'https://raheshgroup.com/wp-content/uploads/2021/06/enegyy-1.jpg',
        title:'آینده پژوهی بازار انرژی در جهان',
        bage:'پژوهش',
        time:'02 ژوئن 2021',
        text: `چکیده امروزه، تجارت بین الملل به عنوان یکی از مهم ترین 
            عوامل توسعه و رشد اقتصادی کشورها از طریق افزایش فرصت های تجاری و سرمایه گذاری محسوب می شود.
            پیوستن به زنجیره ارزش جهانی و توسعه صادرات در کشورهای
            در حال توسعه زمینه بهبود رقابت پذیری را در این کشورها فراهم می کند و
            افزایش ارزش افزوده محصولات، سرمایه گذاری در تحقیق وتوسعه، سرمایه گذاری...`


    },
]

export const ProductServise = {

    getProducts : () => {
        return products.slice();
    } ,

    getProductsById : (id) => {
       return products.find(item =>item.id.toString() == id)
    }
}