
import './About.css'
const About = () => {
    return(
    <div>
        <div className={'container'}>
            <div className='row'>
                <div className='col-12 py-5'>
                    <div className='about-root'>
                        <a href='#' className='pb-2' >
                            <h3>درباره ما</h3>
                        </a>
                       
                        <p>از مهم ترین چالش‌های برنامه‌سازان و تولیدکنندگان آثار فرهنگی و رسانه ای، پژوهش در حوزه های مختلف و تامین و تدوین محتوای مناسب، بررسی روندهای آینده، تعیین خط مشی فعالیت ها براساس روندشناسی و آینده پژوهی در حوزه مربوطه است. در این مسیر، پیدا کردن سوژه‌ی مناسب، به‌روز، جذاب، فراگیر و مخاطب‌پسند و در گام بعدی، ایده پردازی صحیح شامل غربال کردن سوژه، مطالعه مقدماتی، پروراندن ایده، پژوهش و گردآوری اطلاعات و نگارش بر اساس ایده مورد نظر و تبیین سیاست های محتوایی برای آینده، از دغدغه های اصلی به شمار می رود.</p>
                        <br/>
                        <p>مجموعه اینها تخصصی است که کمتر در سازمانی یافت می شود و گروه پژوهشی «رهش» این افتخار را دارد که با تیمی مجرب و متخصص و خوشفکر، در حیطه سوژه‌یابی، ایده‌پردازی و اجرای طرح‌ها و پروژه‌های پژوهشی و آینده پژوهی و آینده نگاری، به مدت 8 سال است که فعالیت می‌کند و به برنامه‌سازان و تولیدکنندگان آثار هنری و رسانه ای در حوزه‌ی مسائل مختلف فرهنگی، اجتماعی، اقتصادی و سیاسی کمک می‌ رساند تا مؤثرترین آثار را خلق کنند.</p>
                    </div>
                </div>
            </div>
        </div>
    </div>
    )}

export default About