import React from "react";
import { useParams } from "react-router";
import { ProductServise } from "./product/ProductServise";
import './Detail.css'
const Detail = (props) => {
    const {id} =useParams()

    

    const data = ProductServise.getProductsById(id);

    return(
        <>
            <div>
        <div className={'container'}>
            <div className='row'>
                <div className='col-12 py-5'>
                    
                    <div > 
                        
                        <div className='detail-root'>
                         <img src={data.pic} width={'100%'}/>  
                       
                        <a href='#'  >
                            <h3 className={'py-3 px-1'}>{data.title}</h3>
                        </a>
                        <div className={'container px-5'}>
                        
                        <br/>
                        <p>{data.text}</p>
                        <br/>

                        <h4> 2- تدوین سند سیاست گذاری محتوایی و رسانه ای</h4>
                        <br/>
                        <p>گروه پژوهشی رهش در این بخش از خدمات خود به نهادها و مؤسسات کمک می کند تا خواسته‌ها و اهدافشان مشخص‌تر و عینی‌تر شود، مخاطبان‌شان را بهتر بشناسند و به لحاظ رسانه‌ای بدانند دقیقاً چه چیزی را باید دنبال کنند. رهش با اتکاء به ظرفیت‌ها و شناخت کافی از مقتضیات هر مجموعه، سند سیاست‌گذاری محتوایی آن را به رشته تحریر در می‌آورد و برای نگارش آن با رصد مستمر فضای خبری و مجازی، بررسی افکارسنجی‌ها و نظرسنجی‌های معتبر ملی، مطالعه‌ی کلان داده‌ها و گردآوری پیشنهادات متخصصان هر حوزه متناسب با نیاز مخاطبین و به وسیله‌ی مسئله‌‏یابی، روندشناسی و آینده‏‌پژوهی، به محورها و موضوعات مهم و دارای اولویت پرداخته و ذیل هر کدام از مسائل رسانه‌ای‌شان موضوعات کلان، سوژه و رویکرد پیشنهاد می‌دهد.

رهش همچنین با شناسایی و تحلیل روندهای تأثیرگذار و آینده‌نگاری در این حوزه با ترسیم دورنما به برنامه‌سازان و تولیدکنندگان محتواهای فرهنگی جهت تولید آثار هنری و رسانه‌ای در قالب‌های گوناگون کمک می‌نماید، امید است که این طریق برای اولویت‌گذاری مدیران و تصمیم‌گیران مجموعه‌‌های رسانه‌ای مفید بوده و زمینه‌ی تولید محصولات ارزشمند را فراهم آورد .</p>

                        <br/>

                        <h4>3- افکارسنجی مخاطبان</h4>
                        <br/>
                        <p>افراد جامعه که هرکدام از قشر منحصر به فرد خودشان سربرآورده اند اگر بالای سرشان ابری فانتزی ترسیم کنیم بی شک تصاویر متفاوتی را شاهد خواهیم بود. هر سازمان و هر محصول رسانه ای برای پیشرفت، نیازمند شناخت تفکرات مرسوم و غیرمرسوم مردم است. افکارسنجی را می توان روشی پژوهشی در مسیر خلق اثری دانست که تکرار اثری دیگر نباشد و این خلاقیت فراگیر و فرافهم باشد. ما در رهش با اجرای پروژه های افکارسنجی، به شما کمک می کنیم که به شناخت خوبی از مخاطبان و ارتباطی که آن ها با پیامهایتان برقرار کرده اند برسید.</p>
                    
                        <br/>

                        <h4>4- تحقیقات بازار</h4>
                        <br/>
                        <p>اطلاعات دقیق و درست، پایه هر کسب وکار موفقی است. کسب و کارها برای موفقیت در بازار، نیازمند اطلاعات دقیق در مورد مشتریان، رقبا و صنعتی هستند که در آن فعالیت می کنند. این اطلاعات به مدیران کمک می کند تا در خصوص شروع فعالیت خود در بازار یا ارائه محصولات بهتر تصمیم گیری کنند. گروه پژوهشی رهش با انجام تحقیقات بازار شامل جمع آوری، تحلیل و تفسیر اطلاعات در مورد بازار و مشتریان، دانش خوبی در مورد ویژگی ها، عادات و علایق، موقعیت و نیازهای مشتریان بالقوه در بازار هدف شما را ارائه می دهد و همچنین وضعیت رقبا را هم بررسی می کند.</p>

                        </div>
                    </div>
                </div>
            </div>
        </div>
        </div>
    </div>
        </>
    )
    
}

export default Detail